Revit 2024 API
TableSectionData.IsValidColumnNumber Method
 Verifies if the column number is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsValidColumnNumber(
	int nCol
)
Visual Basic
Public Function IsValidColumnNumber ( _
	nCol As Integer _
) As Boolean
Visual C++
public:
bool IsValidColumnNumber(
	int nCol
)
Parameters
nCol
Type: System.Int32
 The column number.
Return Value
 True if the column number is between FirstColumnNumber and LastColumnNumber, false otherwise.
See Also
TableSectionData Class
Autodesk.Revit.DB Namespace